000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. HELLO-WORLD.
000300 ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-3780 WITH DEBUGGING MODE.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
          SELECT FILE1 ASSIGN TO 'C-FILE1.md'
          ORGANIZATION IS SEQUENTIAL
          ACCESS IS SEQUENTIAL
          FILE STATUS IS WS-FS1.
          SELECT FILE2 ASSIGN TO 'C-FILE2.md'
          ORGANIZATION IS SEQUENTIAL
          ACCESS IS SEQUENTIAL
          FILE STATUS IS WS-FS2. 
000350 DATA DIVISION.
000400 FILE SECTION.
000500 FD  FILE1.
000550 01  FILE1-REC.
           05 NAME-FIELD PIC X(39).
000600 FD  FILE2.
       01 FILE2-REC.
000650     05  NUMBER-FIELD  PIC 9(5).
           05 WS-COMP PIC S9(6) COMP.
           05 FILLER PIC X(75).
       WORKING-STORAGE SECTION.
       01 WS-FS1 PIC 9(2). 
       01 WS-FS2 PIC 9(2). 
       01 WS-EOF PIC X(1) VALUE 'N'.
000700 PROCEDURE DIVISION.
000750     OPEN INPUT FILE1.
           OPEN OUTPUT FILE2.
      D    DISPLAY 'DEBUGGED SUCCESSFULLY'.
           PERFORM READ-PARA UNTIL WS-EOF='Y'.
           MOVE -123445 TO WS-COMP.
           WRITE FILE2-REC.
           CLOSE FILE1,FILE2.
           STOP RUN.
       READ-PARA.
           READ FILE1.
           EVALUATE WS-FS1
           WHEN 00
              DISPLAY NAME-FIELD
           WHEN 10
              DISPLAY NAME-FIELD
              MOVE 'Y' TO WS-EOF
           WHEN OTHER
              DISPLAY 'FILE STATUS' WS-FS1
              MOVE 'Y' TO WS-EOF
           END-EVALUATE.
           
